<style lang="scss" scoped>
.protocol {
  position: absolute;
  top: 0;
  left: 0;
  right: 0;
  bottom: 0;
  display: flex;
  flex-direction: column;
  justify-content: flex-start;
  font-family: 'PingFangSC-Regular';
  .protocol-content {
    flex: 1;
    padding: 15px;
    overflow: auto;
    .title {
      font-weight: bold;
      font-size: 24px;
      color: #222;
    }
    .subtitle {
      font-size: 22px;
      color: #444;
    }
    .p1 {
      font-size: 16px;
      line-height: 24px;
      color: #666;
    }
    .p2 {
      font-size: 15px;
      color: #666;
      line-height: 22px;
    }
    .p3 {
      font-size: 14px;
      color: #666;
      line-height: 20px;
    }
    .p3 {
      font-size: 13px;
      color: #666;
      line-height: 18px;
    }
    .p4 {
      font-size: 12px;
      color: #666;
      line-height: 16px;
    }
    .p5 {
      font-size: 10px;
      color: #666;
      line-height: 14px;
    }
  }
}
</style>

<template>
  <div class="protocol">
    <div class="protocol-content">
      <p class="title">好价鼻子隐私政策</p>
      <p class="subtitle">引言</p>
      <p class="p1">好价鼻子（以下简称“好价鼻子”或“我们”）非常重视您的个人信息，并让您对个人信息拥有控制权，我们会使用强大的加密技术来保护您的隐私，同时制定严格的政策来管理所有数据。当您访问好价鼻子时，或使用我们提供的服务前，您需要同意本政策中关于我们如何收集、使用、储存和分享您的相关信息的规定。如果您不同意本隐私政策中的任何内容，请立即停止使用或访问我们的产品和服务。 本隐私权政策旨在协助您了解我们会收集哪些信息、为什么收集这些信息，以及您如何更新、管理、导出和删除自己的信息。</p>
      <p class="subtitle">术语</p>
      <p class="p2">Cookie：Cookie 是包含字符串的小文件，会在您访问网站时发送到您的计算机上。当您再次访问网站时，Cookie 使该网站可以识别您的浏览器。Cookie 还能存储用户使用偏好及其他信息。您可以重置您的浏览器拒绝所有的 Cookie，或者在发送 Cookie 时提示。但如果没有 Cookie，某些网站功能或服务可能无法正常工作。</p>
      <p class="p2">应用数据缓存：应用数据缓存是指设备上的一种数据存储机制。使用它有很多好处，例如，可让网络应用在未连接互联网的情况下运行，以及可通过提高内容加载速度来改善相关应用的性能。</p>
      <p class="p2">个人信息：用户向我们提供的、可用于识别用户的个人身份的信息，例如姓名、电子邮件地址、电话号码、银行卡号、身份证号码、住址、通讯记录等信息，或我们可以正当地通过链接找到此类信息的其他数据。</p>
      <p class="p2">IP地址：每台连接到互联网的计算机都指定了唯一的编号，称为互联网协议 (IP) 地址。由于这些编号通常都是根据国家/地区的区域指定的，因此 IP 地址通常可用于识别计算机连接至互联网时所在的国家/地区。</p>
      <p class="subtitle">一. 我们如何搜集和使用您的信息</p>
      <p class="p2">1. 我们如何搜集您的信息我们提供服务时，可能会收集、储存和使用下列信息：</p>
      <p class="p3">1.1 您在使用服务过程中，我们获取的信息我们会收集您使用的服务以及使用方式的信息，如您何时在好价鼻子进行商品转链，何时访问了我们的广告服务，或何时查看了我们的广告和内容。此类信息包括：</p>
      <p class="p4">1.1.1 设备信息：我们会收集设备专用的信息，例如您的硬件型号、操作系统信息、移动设备版本、设备识别码、屏幕分表率等信息。</p>
      <p class="p4">1.1.2 日志信息</p>
      <p class="p5">A. 设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；</p>
      <p class="p5">B. 在使用我们服务时搜索或浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页面url地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；</p>
      <p class="p4">1.1.3 IP地址</p>
      <p class="p5">A. 有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息；</p>
      <p class="p5">B. 您通过我们的服务进行通讯的信息，例如曾通讯的账号，以及通讯时间、数据和时长；</p>
      <p class="p5">C. 您通过我们的服务分享的内容所包含的信息（元数据），例如拍摄或上传的共享照片或录像的日期、时间或地点等。</p>
      <p class="p4">1.1.4 相册</p>
      <p class="p5">当用户需要将商品图片保存到本地时,需要用户授权,访问用户的相册,将图片保存到本地。</p>
      <p class="p2">2. 我们如何使用您的信息</p>
      <p class="p2">我们可能将上述收集的信息用作以下用途：</p>
      <p class="p3">2.1 向您提供服务；</p>
      <p class="p3">2.2 在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性;</p>
      <p class="p3">2.3 帮助我们设计新服务，改善我们现有服务；</p>
      <p class="p3">2.4 使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应；</p>
      <p class="p3">2.5 向您提供与您更加相关的广告以替代普遍投放的广告；</p>
      <p class="p3">2.6 评估我们服务中的广告和其他促销及推广活动的效果，并加以改善；</p>
      <p class="p3">2.7 执行软件验证、升级服务；</p>
      <p class="p3">2.8 应用户特殊要求而提供特定服务时，需要将信息提供给我们的关联公司、第三方或其他用户；</p>
      <p class="p3">2.9 其他有利于用户和好价鼻子运营者利益且不违反任何强制性法律法规的情况。</p>
      <p class="p3">2.10 让您参与有关我们产品和服务的调查</p>
      <p class="p2">3. 我们承诺</p>
      <p class="p3">3.1 我们不会根据敏感类别（例如种族、宗教、性取向或健康状况）向您展示个性化广告；</p>
      <p class="p3">3.2 我们不会与广告主分享可用于识别您个人身份的信息，例如您的姓名或电子邮件地址（除非经您授权同意）；</p>
      <p class="p3">3.3 在任何时候、任何情况下都不会向任何第三方出售您的个人信息，我们只会在法律允许的范围内使用根据本协议获得的信息。我们会制定严格的政策保护您的个人信息，除非事先获得您的授权或本声明另有规定之外，不会将您的这些信息对外公开或向第三方提供。</p>
      <p class="p2">4. 为保证服务质量，我们可能会由关联公司或其他可信合作单位向您提供您所要求的服务或您可能感兴趣的内容。您同意我们向关联公司或合作单位分享该产品、服务所必须的个人信息。我们会要求关联公司及合作单位按照我们的说明、隐私政策以及任何其他适当的保密和安全措施来保证您的个人信息安全。除此之外，我们不会向任何第三方提供或分享您的信息。</p>
      <p class="p2">5. 我们不会将您的个人信息转移或披露给任何非关联的第三方，除非：</p>
      <p class="p3">5.1 相关法律法规、法律程序、政府机关的强制性要求；</p>
      <p class="p3">5.2 为完成合并、分立、收购或资产转让而转移；</p>
      <p class="p3">5.3 事先获得您的授权；</p>
      <p class="p3">5.4 您使用共享功能；</p>
      <p class="p3">5.5 以学术研究或公共利益为目的；</p>
      <p class="p3">5.6 在法律法规和政策允许的范围内，为提升用户体验和提供个性化的推广服务；</p>
      <p class="p3">5.7 我们认为必要且不违反法律强制性规定的其他情形。</p>
      <p class="p2">6. 除非经过您的同意，否则我们不会向任何人提供您的敏感个人信息。</p>
      <p class="subtitle">二. 如何更新、变更、导出、删除您的信息</p>
      <p class="p2">1. 您在使用我们的产品和服务时，会被要求提供您真实的个人信息，您应当对您所提供信息的真实性、合法性、有效性及完整性负责，并及时更新和维护您的个人信息，以保证信息的真实、合法和有效。您可以随时管理您的个人信息，例如您的个人账户注册信息。</p>
      <p class="p2">2. 您可以自行从好价鼻子中删除您的内容或个人信息，或要求我们删除或修改信息。</p>
      <p class="p2">3. 在有些情况下，我们会出于法律目的或合法业务的需要将数据保留有限的一段时间。我们会尽力确保好价鼻子的服务能够保护信息免遭意外或恶意删除。因此，如果您删除了某些内容，我们可能会过一段时间才会从我们现用的和备用的系统中删除其副本。</p>
      <p class="p2">4. 您可以随时备份个人帐户名下的内容或将其用于非好价鼻子服务。</p>
      <p class="subtitle">三. 我们如何保护您的个人信息</p>
      <p class="p2">1. 所有好价鼻子产品都内置了强大的安全功能，并且我们制定了严格的信息管理政策，配备专业的技术团队，采取了一系列合理的预防措施，以保护您的个人信息不会遭受未经授权的浏览、披露、滥用、变更、破坏以及损失，其中包括：</p>
      <p class="p3">（1）使用加密技术来确保您的数据在传输过程中保持私密性；</p>
      <p class="p3">（2）提供多种安全功能来协助您保护自己的帐号安全；</p>
      <p class="p3">（3）审查我们在收集、存储和处理信息方面的做法（包括实体安全措施），以防未经授权的人员访问我们的系统；</p>
      <p class="p2">2. 我们非常重视未成年人信息的保护。我们只会在法律允许的范围内，或依当地法律取得监护人的同意，或是为了保护未成年人而使用或披露有关未成年人的个人数据。“未成年人”的定义应考虑适用的法律以及各国家和地区的文化惯例。</p>
      <p class="subtitle">五. 您分享的信息</p>
      <p class="p2">1. 我们的登录与微信开放平台打通,登录成功后会读取到你微信里面的昵称,性别,用户头像等信息.</p>
      <p class="subtitle">六. 数据传输</p>
      <p class="p2">1. 我们维护着遍布世界各地的服务器，因此，我们处理您的信息时所用的服务器可能并不是位于您所在的国家或地区。数据保护法律因国家或地区而异，不同国家或地区的数据保护力度也是有强有弱。无论是在哪里处理您的信息，我们都会一律采用本政策中所述的保护措施。另外，我们还会遵守某些与数据传输有关的法律框架，例如“EU-US Privacy Shield Frameworks”和“Swiss-US Privacy Shield Frameworks”。</p>
      <p class="p2">2. 收到正式的书面投诉后，我们会与投诉方联系。我们会与相应的监管机构（包括当地的数据保护机构）合作，以解决任何与传输您的数据有关且无法由我们和您直接解决的投诉。</p>
      <p class="subtitle">七. 第三方服务提供商</p>
      <p class="p2">为方便您的访问并丰富您的体验，可能会有第三方提供的产品或服务。您可以选择是否访问这类内容或链接，或是否使用该第三方的产品或服务。但我们对于第三方提供的产品或服务没有控制权。我们无法控制第三方掌握的您的任何个人信息。您在使用第三方产品或服务过程中的信息保护问题，不适用于本政策的管理。本政策也不适用于您自行选择提供给第三方的任何信息。请您查看该第三方的隐私保护政策。</p>
      <p class="subtitle">八.本政策的更新</p>
      <p class="p2">我们可能会不定期修改、更新本隐私政策，有关隐私政策的更新，我们会在好价鼻子中以通知公告等形式发布，您可以访问App Store好价鼻子页面查询最新版本的隐私政策。</p>
      <p class="subtitle">公司简介</p>
      <p class="p3">公司名称：杭州启立网络科技有限公司</p>
      <p class="p3">注册地：浙江省杭州市余杭区仓前街道良睦路1399号4号楼202-14室</p>
      <p class="p3">常用办公地点：浙江省杭州市余杭区仓前街道良睦路1399号4号楼202-14室</p>
      <p class="p3">信息保护负责人联系电话：18156884632</p>
    </div>
  </div>
</template>

<script>
export default {

}
</script>
